{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and admin-managed offers with create, update, delete operations.",
  "feature_evidence.json": "Feature evidence report linking a footer credit-line update to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including layout, pages, components, and styling.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme variables and global element defaults.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining all routes and wrapping them in layout and theme provider.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component that restricts access to admin-only routes with login and error handling UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication state and query cache.",
  "frontend/src/components/cta/FloatingContactCtas.tsx": "Floating WhatsApp and phone call action buttons with tooltips.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing store info, quick links, category list, Caffeine.ai link, and Aditya Sharma credit.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with navigation links, admin-only actions, login, and mobile sheet menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, footer, main content, and floating contact CTAs.",
  "frontend/src/components/marketing/CategoryCard.tsx": "Displays a category card with image, title, and description using a responsive image.",
  "frontend/src/components/marketing/CategoryQuickLinks.tsx": "Grid of quick-link buttons for major categories, each with an icon and navigation action.",
  "frontend/src/components/marketing/TrustIndicators.tsx": "Shows three trust indicator cards highlighting quality, pricing, and convenience.",
  "frontend/src/components/marketing/WhyChooseUs.tsx": "Section listing five benefits of the store with icons and descriptions.",
  "frontend/src/components/media/ResponsiveImage.tsx": "Wrapper for an img tag supporting lazy/priority loading and optional aspect ratio styling.",
  "frontend/src/components/offers/OfferCard.tsx": "Card displaying offer details including discount badge and formatted date range.",
  "frontend/src/components/offers/OfferEditorDialog.tsx": "Dialog form for creating or editing offers with validation and save handling.",
  "frontend/src/components/seo/Seo.tsx": "Updates document title, meta tags, and optional structured data for SEO.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Hook that fetches and returns whether the current actor has admin privileges.",
  "frontend/src/hooks/offers/useActiveOffers.ts": "Hook fetching active offers via the actor API.",
  "frontend/src/hooks/offers/useAdminOffers.ts": "Admin offers management hook providing CRUD mutations and query invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode variants, animations, and utility classes for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero content, store story, values, and SEO metadata.",
  "frontend/src/pages/admin/AdminOffersPage.tsx": "Admin interface for creating, editing, deleting, and toggling offers with dialogs and table views. Handles CRUD operations via useAdminOffers and shows toast feedback.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays product categories in a styled grid with SEO setup and supporting sections.",
  "frontend/src/pages/ContactPage.tsx": "Shows store contact info, location details, and embedded map along with SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing-focused home page with hero banners, category links, trust indicators, and promotional sections. Uses navigation buttons and SEO metadata.",
  "frontend/src/pages/OffersPage.tsx": "Displays active offers with a hero banner, savings message, and conditional loading/error states. Fetches offers and renders OfferCard components.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and removing parameters from hash routing. Supports fallback between URL and session storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended color system, typography, animations, and container settings. Defines custom themes, shadows, fonts, and plugin integrations.",
  "project_state.json": "Defines project state and requirements for building a responsive multi-page marketing site for IN2 Supermart. Lists architectural notes, existing features, and planned pages and content."
}