{
  "backend/main.mo": "Motoko canister handling user profiles with authorization checks and full CRUD operations for offers stored in maps.",
  "feature_evidence.json": "Feature-evidence report mapping product features to supporting frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend components, pages, and hooks.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH CSS variables for light and dark themes.",
  "frontend/index.html": "Root HTML file mounting the React app and loading the main module script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes wrapped in SiteLayout and integrates theme provider and admin-protected routes.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that enforces admin authentication using Internet Identity and role checks with fallback UI states.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button for login/logout via Internet Identity with loading and error handling.",
  "frontend/src/components/cta/FloatingContactCtas.tsx": "Floating WhatsApp and phone call action buttons with tooltips for quick customer contact.",
  "frontend/src/components/layout/Footer.tsx": "Renders a footer with store info, quick links, category links, and a dynamic copyright plus referral link.",
  "frontend/src/components/layout/HeaderNav.tsx": "Implements the site header with navigation links, admin controls, login button, and a mobile slide-out menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with header, footer, and floating contact CTAs inside a full-height layout.",
  "frontend/src/components/marketing/CategoryCard.tsx": "Displays a category card with an image, title, and description using a responsive image component.",
  "frontend/src/components/marketing/CategoryQuickLinks.tsx": "Provides quick category navigation buttons with icons that redirect users to the categories page.",
  "frontend/src/components/marketing/TrustIndicators.tsx": "Shows a set of trust indicator cards highlighting quality, pricing, and local convenience.",
  "frontend/src/components/marketing/WhyChooseUs.tsx": "Displays a multi-card section outlining reasons to shop at the store with icons and descriptions.",
  "frontend/src/components/media/ResponsiveImage.tsx": "A wrapper around img that supports lazy loading, priority loading, and optional aspect ratio styling.",
  "frontend/src/components/offers/OfferCard.tsx": "Shows an offer card with title, description, discount badge, and validity dates formatted from bigint timestamps.",
  "frontend/src/components/offers/OfferEditorDialog.tsx": "Provides a dialog form for creating or editing offers with validation and date handling.",
  "frontend/src/components/seo/Seo.tsx": "Dynamically sets page SEO metadata and optionally injects structured JSON-LD data for the store.",
  "frontend/src/hooks/auth/useCallerRole.ts": "Fetches and exposes the caller's admin role status using a backend actor and React Query.",
  "frontend/src/hooks/offers/useActiveOffers.ts": "Retrieves the list of active offers from the backend actor using React Query.",
  "frontend/src/hooks/offers/useAdminOffers.ts": "Provides React Query hooks to fetch, create, update, delete, and toggle offers using the authenticated actor and invalidates related queries on mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context with login, logout, and identity loading via Dfinity AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables, dark mode settings, typography, and custom animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, hero section, story content, and values grid.",
  "frontend/src/pages/admin/AdminOffersPage.tsx": "Admin interface for creating, editing, toggling, and deleting promotional offers. Uses dialogs, tables, and mutation hooks for offer management with toast notifications.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays the product categories page with SEO metadata, a hero section, category grid, and additional info section.",
  "frontend/src/pages/ContactPage.tsx": "Renders the store contact page with SEO metadata, address, hours, phone info, and an embedded Google Map. Uses cards and layout sections for contact details and directions.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero content, category links, trust indicators, and promotional sections. Includes SEO setup and navigation to categories and offers.",
  "frontend/src/pages/OffersPage.tsx": "Displays active offers with loading, error, and empty states, plus promotional messaging and a banner. Fetches offers via a custom hook and renders them using OfferCard components.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and clearing parameters from URLs. Supports both standard and hash‑based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, container settings, extended fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state, requirements, architectural notes, image needs, and implemented features for building a responsive marketing website for IN2 Supermart."
}