{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "IN2 Supermart responsive marketing website (pages, offers, admin, SEO, CTAs)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Establish a bright, premium, mobile-first visual system (green/orange/white), typography, and subtle animations across the site.",
      "acceptanceCriteria": [
        "Site uses a consistent green/orange/white palette and readable typography across all pages.",
        "All pages are mobile-first and adapt correctly to common breakpoints (mobile/tablet/desktop).",
        "Animations are present (e.g., hover, section reveal, carousel transitions) and do not block interaction or reduce readability.",
        "Design reflects a premium supermarket feel with a local Indian neighborhood market vibe (visual styling only; no new features implied)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define global theme tokens (green/orange/white), base typography, and reusable animation utilities (lightweight transitions, focus states) to enforce consistent styling across all pages."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind theme with IN2 brand colors and optional custom keyframes/animations to support subtle UI motion consistently."
        },
        {
          "path": "frontend/src/components/layout/SiteLayout.tsx",
          "operation": "create",
          "description": "Create a shared layout wrapper (header + footer + main container) with responsive spacing and subtle motion; compose with shadcn-ui primitives where appropriate. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement required pages, client-side routes, responsive navigation (hamburger + desktop), and a footer with address and quick links.",
      "acceptanceCriteria": [
        "Each required page is accessible via client-side navigation and has a distinct route/screen.",
        "Navigation is usable on mobile and desktop.",
        "Footer includes store name, full address, and links to the main pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the app router to include routes for Home, About Us, Categories, Offers & Deals, Visit Store / Contact, and (if required by REQ-10/11) Admin Offers; ensure navigation links resolve to these routes."
        },
        {
          "path": "frontend/src/components/layout/HeaderNav.tsx",
          "operation": "create",
          "description": "Create responsive header navigation with desktop top-nav and mobile hamburger menu using shadcn-ui navigation and Sheet/Drawer patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "create",
          "description": "Create site footer including IN2 Supermart name, the full address, and quick links to main pages."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "create",
          "description": "Create the Home page view and ensure it renders inside the shared SiteLayout."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "create",
          "description": "Create the About Us page view and ensure it renders inside the shared SiteLayout."
        },
        {
          "path": "frontend/src/pages/CategoriesPage.tsx",
          "operation": "create",
          "description": "Create the Categories page view and ensure it renders inside the shared SiteLayout."
        },
        {
          "path": "frontend/src/pages/OffersPage.tsx",
          "operation": "create",
          "description": "Create the Offers & Deals page view and ensure it renders inside the shared SiteLayout."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "create",
          "description": "Create the Visit Store / Contact page view and ensure it renders inside the shared SiteLayout."
        },
        {
          "path": "frontend/src/components/layout/SiteLayout.tsx",
          "operation": "modify",
          "description": "Compose HeaderNav and Footer into the shared layout and expose a slot for page content."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Build the Home page hero and required sections: tagline hero, offers/daily essentials/featured categories highlights, category quick links, and trust indicators.",
      "acceptanceCriteria": [
        "Home page hero prominently displays the exact tagline text.",
        "Home page includes sections for offers/promotions, daily essentials, featured categories, and trust indicators.",
        "Category quick links navigate to the Categories page and/or on-page category section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Implement hero section with exact tagline “Fresh Groceries. Smart Prices. Near You.” plus highlight sections (offers, daily essentials, featured categories) and trust indicators; wire category quick links to Categories route."
        },
        {
          "path": "frontend/src/components/marketing/CategoryQuickLinks.tsx",
          "operation": "create",
          "description": "Create a reusable quick-links component for the six categories and link interactions to the Categories page."
        },
        {
          "path": "frontend/src/components/marketing/TrustIndicators.tsx",
          "operation": "create",
          "description": "Create a trust indicator strip/cards emphasizing quality products, affordable pricing, and local convenience using shadcn-ui Card/Badge patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/media/ResponsiveImage.tsx",
          "operation": "create",
          "description": "Create a small image wrapper to standardize responsive sizing, aspect ratios, and optional lazy-loading for hero and section imagery."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Create an About Us page with Sonipat-local positioning and friendly-professional copy focused on freshness, value, and customer satisfaction.",
      "acceptanceCriteria": [
        "About page copy explicitly mentions Sonipat and emphasizes freshness, value, and customer satisfaction.",
        "Tone reads friendly yet professional (no slang, no overly corporate wording)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Add About copy that explicitly mentions Sonipat and highlights freshness, value-for-money, and customer satisfaction; keep heading hierarchy clear and content readable on mobile."
        },
        {
          "path": "frontend/src/components/marketing/WhyChooseUs.tsx",
          "operation": "create",
          "description": "Create a reusable “Why Choose Us” section component that can be placed on Home and/or About with icon-emphasized bullets using shadcn-ui Card/Icon patterns. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Create Categories page with six category cards, each with visuals and concise subtitles, using a responsive grid layout.",
      "acceptanceCriteria": [
        "All six categories are shown with consistent card styling.",
        "Each category has a visual (image or illustration) and a short description.",
        "Layout is responsive (grid on desktop, stacked or 2-column on mobile as appropriate)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CategoriesPage.tsx",
          "operation": "modify",
          "description": "Render six category cards with consistent styling and short descriptions; use responsive layout for mobile/tablet/desktop."
        },
        {
          "path": "frontend/src/components/marketing/CategoryCard.tsx",
          "operation": "create",
          "description": "Create a reusable category card (image + title + subtitle) built with shadcn-ui Card components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CategoriesPage.tsx",
          "operation": "modify",
          "description": "Wire the generated static assets into each category card: frontend/public/assets/generated/cat-fruits-veg.dim_800x600.png, frontend/public/assets/generated/cat-dairy-bakery.dim_800x600.png, frontend/public/assets/generated/cat-packaged-foods.dim_800x600.png, frontend/public/assets/generated/cat-household.dim_800x600.png, frontend/public/assets/generated/cat-beverages-snacks.dim_800x600.png, frontend/public/assets/generated/cat-personal-care.dim_800x600.png."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Implement Offers & Deals page with Weekly Promotions and Today’s Special Discounts, family/student savings messaging, and offer cards with validity period.",
      "acceptanceCriteria": [
        "Offers page includes a Weekly Promotions section and a Today’s Special Discounts section with clearly labeled headings.",
        "Offer cards/banners show at minimum: title, short description, and validity period (or placeholder when not set).",
        "Copy includes savings-oriented messaging relevant to families and students."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OffersPage.tsx",
          "operation": "modify",
          "description": "Implement Offers page layout with clearly labeled Weekly Promotions and Today’s Special Discounts sections; include savings-oriented copy for families and students and render offer cards with title/description/validity."
        },
        {
          "path": "frontend/src/components/offers/OfferCard.tsx",
          "operation": "create",
          "description": "Create an offer card component that displays title, description, discount label, and start/end validity (or placeholder when missing), using shadcn-ui Card/Badge components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/OffersPage.tsx",
          "operation": "modify",
          "description": "Add the offers banner image to the page using frontend/public/assets/generated/in2-offers-banner.dim_1600x500.png and ensure it is responsive with stable layout."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add a responsive “Why Choose Us” section listing the five required benefits with icon/visual emphasis.",
      "acceptanceCriteria": [
        "All five bullets appear in the UI with clear icons or visual emphasis.",
        "Section is responsive and readable on small screens."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/WhyChooseUs.tsx",
          "operation": "modify",
          "description": "Ensure the component lists exactly: Affordable pricing, Wide product range, Convenient neighborhood location, Friendly service, Fresh stock daily; apply icon/visual emphasis via shadcn-ui patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Place the Why Choose Us section on the Home page in a prominent location with responsive spacing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Create Visit Store / Contact page with Google Map iframe embed, exact address, hours, directions prompt, and phone placeholder.",
      "acceptanceCriteria": [
        "Contact page shows the exact provided address text.",
        "Store hours are displayed and include “Open daily” and “closes at 10 PM”.",
        "A Google Map embed is visible (using an iframe embed is acceptable).",
        "A phone number placeholder is visible and clearly labeled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Implement the Visit Store / Contact content: Google Map iframe embed, exact address “No. 134 Basement, 135P, Sector 23, Sonipat, Haryana – 131001, India”, store hours “Open daily, closes at 10 PM”, directions prompt, and a clearly labeled phone placeholder."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add site-wide conversion CTAs: floating WhatsApp deep link and click-to-call (tel:) using the phone placeholder, without obstructing mobile content.",
      "acceptanceCriteria": [
        "WhatsApp CTA is visible (floating or persistent placement) and links to a WhatsApp action using a placeholder number until finalized.",
        "Click-to-call uses a tel: link with the same placeholder number.",
        "On mobile, CTAs do not cover primary navigation or core content (tested on narrow viewport)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/cta/FloatingContactCtas.tsx",
          "operation": "create",
          "description": "Create a floating CTA widget containing a WhatsApp deep link (placeholder number) and a click-to-call tel: link (same placeholder number); ensure accessible labels and mobile-safe positioning."
        },
        {
          "path": "frontend/src/components/cta/FloatingContactCtas.tsx",
          "operation": "modify",
          "description": "Use the generated CTA background asset for WhatsApp-style visual treatment: frontend/public/assets/generated/whatsapp-cta-bg.dim_256x256.png."
        },
        {
          "path": "frontend/src/components/layout/SiteLayout.tsx",
          "operation": "modify",
          "description": "Mount FloatingContactCtas site-wide so it appears across all pages, ensuring it does not overlap navigation or primary content on mobile."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Render offers from backend data and provide an admin UI to create/edit/delete/toggle offers with validation (no frontend redeploy needed to update content).",
      "acceptanceCriteria": [
        "Backend exposes methods to: fetch active offers (public) and create/update/delete offers (admin-only).",
        "Frontend Offers page renders from backend-provided offer data and updates after changes without redeploying the frontend.",
        "Admin UI supports creating, editing, deleting, and toggling active status for offers, and includes validation for required fields (e.g., title)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/offers/useActiveOffers.ts",
          "operation": "create",
          "description": "Create a React Query hook that uses the backend actor to fetch active offers for public display (using available backend methods from the generated actor)."
        },
        {
          "path": "frontend/src/pages/OffersPage.tsx",
          "operation": "modify",
          "description": "Replace any static offers content with backend-driven rendering using useActiveOffers; ensure the UI updates after admin changes (query invalidation/refetch)."
        },
        {
          "path": "frontend/src/pages/admin/AdminOffersPage.tsx",
          "operation": "create",
          "description": "Create an admin offers management screen to list all offers and support create/edit/delete/toggle active, using shadcn-ui Table/Dialog/Form inputs. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/offers/useAdminOffers.ts",
          "operation": "create",
          "description": "Create React Query hooks for admin operations (getAllOffers, createOffer, updateOffer, deleteOffer, toggleOfferActiveState) with cache invalidation and basic error handling."
        },
        {
          "path": "frontend/src/components/offers/OfferEditorDialog.tsx",
          "operation": "create",
          "description": "Create an offer create/edit dialog with required-field validation (at minimum title) and fields for title/description/discountLabel/startDate/endDate/active using shadcn-ui Dialog and form inputs. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register and wire a client-side route for the admin offers page and add a navigation entry (only visible to admins per REQ-11)."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add Internet Identity login and admin-only UI gating so only authorized admins can access offer management actions.",
      "acceptanceCriteria": [
        "Unauthenticated users can view offers but cannot call create/update/delete methods (backend rejects).",
        "Authenticated non-admin users cannot modify offers (backend rejects).",
        "Authenticated admin can perform CRUD operations successfully via the admin UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "create",
          "description": "Add a Login/Logout button using the authorization component’s Internet Identity guidance and the existing useInternetIdentity hook; clear cached queries on logout. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/auth/useCallerRole.ts",
          "operation": "create",
          "description": "Create a hook to fetch caller role/admin status from the backend actor (e.g., getCallerUserRole and/or isCallerAdmin) to drive UI gating and admin route protection."
        },
        {
          "path": "frontend/src/components/auth/AdminRouteGuard.tsx",
          "operation": "create",
          "description": "Create an admin-only route guard that requires authentication and admin role before rendering admin screens; show an access denied state for unauthorized users (no public blocking for marketing pages)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the admin offers route with AdminRouteGuard and add LoginButton into the header navigation area."
        },
        {
          "path": "frontend/src/pages/admin/AdminOffersPage.tsx",
          "operation": "modify",
          "description": "Handle authorization failures from backend-protected methods gracefully (surface a clear error message and keep UI responsive), consistent with the authorization component guidance. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Add SEO-ready titles/meta, heading hierarchy, LocalBusiness/GroceryStore structured data, and include target local keywords naturally.",
      "acceptanceCriteria": [
        "Each page has a unique, relevant title and meta description.",
        "Pages use a sensible H1/H2/H3 hierarchy (one H1 per page).",
        "Structured data is present and includes store name and full address.",
        "The specified keywords appear naturally in page copy and/or metadata (not keyword-stuffed)."
      ],
      "file_operations": [
        {
          "path": "frontend/package.json",
          "operation": "modify",
          "description": "Add an SEO head management library (e.g., react-helmet-async) to support per-route titles/meta and structured data."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Wrap the app with the chosen SEO head provider (e.g., HelmetProvider) so pages can set titles/meta/structured data."
        },
        {
          "path": "frontend/src/components/seo/Seo.tsx",
          "operation": "create",
          "description": "Create a reusable SEO component to set page title, meta description, and inject LocalBusiness/GroceryStore JSON-LD including store name and full address; ensure keyword phrases are used naturally in metadata where appropriate."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add Seo usage for Home (title/meta) and ensure on-page headings follow one-H1 hierarchy and include local keyword phrasing naturally (e.g., “Supermarket in Sonipat”)."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Add Seo usage for About and ensure heading hierarchy is correct; incorporate relevant keyword phrasing naturally (e.g., “Daily Needs Store Near Me”) without stuffing."
        },
        {
          "path": "frontend/src/pages/CategoriesPage.tsx",
          "operation": "modify",
          "description": "Add Seo usage for Categories and ensure heading hierarchy is correct; incorporate relevant keyword phrasing naturally (e.g., “Grocery Store Sector 23 Sonipat”)."
        },
        {
          "path": "frontend/src/pages/OffersPage.tsx",
          "operation": "modify",
          "description": "Add Seo usage for Offers & Deals and ensure heading hierarchy is correct; include natural local savings messaging and relevant keywords in a non-spammy way."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Add Seo usage for Visit Store / Contact and ensure the LocalBusiness/GroceryStore structured data includes the full address and store name."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Optimize performance: responsive/optimized images, lazy-loading below-the-fold, minimize layout shift in hero/offers, and keep animations lightweight.",
      "acceptanceCriteria": [
        "Largest images use appropriately sized assets and do not load at full resolution on mobile unnecessarily.",
        "Non-critical images below the fold are lazy-loaded.",
        "Hero section renders without major layout shift (no large content jumps after load)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/media/ResponsiveImage.tsx",
          "operation": "modify",
          "description": "Support explicit width/height or aspect-ratio control, optional priority loading for above-the-fold hero, and default lazy-loading for below-the-fold images to reduce layout shift and improve performance."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure hero image is rendered with stable dimensions to minimize layout shift; lazy-load non-critical imagery below the fold and keep animations lightweight."
        },
        {
          "path": "frontend/src/pages/CategoriesPage.tsx",
          "operation": "modify",
          "description": "Lazy-load category images and ensure images are displayed responsively without stretching/pixelation."
        },
        {
          "path": "frontend/src/pages/OffersPage.tsx",
          "operation": "modify",
          "description": "Ensure offers banner and offer cards avoid layout shift by reserving space and using responsive image handling; keep transitions subtle."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Integrate generated static grocery/lifestyle imagery throughout hero, categories, and offers with cohesive premium look and responsive presentation.",
      "acceptanceCriteria": [
        "Hero, category cards, and at least one offers banner include high-quality imagery.",
        "All imagery is served as static assets from the frontend and looks cohesive in style/color grading.",
        "Images are responsive and do not appear stretched or pixelated on common screen sizes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Wire hero and lifestyle imagery into the Home page using frontend/public/assets/generated/in2-hero.dim_1920x900.png and frontend/public/assets/generated/in2-lifestyle.dim_1600x900.png with responsive rendering and consistent styling."
        },
        {
          "path": "frontend/src/pages/OffersPage.tsx",
          "operation": "modify",
          "description": "Ensure at least one offers banner uses frontend/public/assets/generated/in2-offers-banner.dim_1600x500.png and matches the overall premium theme visually."
        },
        {
          "path": "frontend/src/components/marketing/CategoryCard.tsx",
          "operation": "modify",
          "description": "Standardize category card image presentation (consistent aspect ratio/cropping) to keep visuals cohesive and premium across the six generated category images."
        }
      ]
    }
  ]
}